# SetOpacity

## Description
Sets the opacity of the object to the opacity passed in.

```pascal
PROCEDURE SetOpacity(
				h       : HANDLE;
				opacity : INTEGER);
```

```python

def vs.SetOpacity(h, opacity):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||
|opacity|INTEGER||

## Version
Availability: from VectorWorks 2008
## Category
* Object Attributes